data/WS-Addressing/ws-addressing-14.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:2c9ae312-0006-458a-a6a0-f9cc052f2f97</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address><ReferenceParameters><ck:CustomerKey xmlns:ck="http://example.org/customer">Key#123456789</ck:CustomerKey></ReferenceParameters></ReplyTo><FaultTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address><ReferenceParameters><ck:CustomerKey xmlns:ck="http://example.org/customer">Fault#123456789</ck:CustomerKey></ReferenceParameters></FaultTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo" xmlns="http://example.org/notify">fault-test1133</ns2:echoIn></S:Body></S:Envelope>